In [5]:
data ={"Name":['Jim', "Sara", "Jill"],
        "Age":[18, 34, 56]}

In [6]:
import pandas as pd
pd.DataFrame(data)

   Name  Age
0   Jim   18
1  Sara   34
2  Jill   56

In [8]:
pets =['dog','cat', 'pig']
pets

['dog', 'cat', 'pig']

In [9]:
table['pets']=pets
table

   Name  Age pets
0   Jim   18  dog
1  Sara   34  cat
2  Jill   56  pig